In [26]:
from numpy import nan as NA
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [27]:
data = Series([1, NA, 3.5, NA, 7])

In [28]:
data. dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [29]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [30]:
data = DataFrame([[1., 6.5, 3.], [1, NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [31]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [32]:
data.dropna(how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [33]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [34]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [56]:
df = DataFrame(np.random.randn(7,3))

In [57]:
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -0.886260       NaN       NaN
1 -0.387692       NaN       NaN
2 -1.221398       NaN -1.664044
3  0.331100       NaN -0.770880
4 -0.344377 -1.351671  0.560334
5  1.790210 -0.372641 -1.273319
6 -1.037575  0.163970 -0.627537

In [58]:
df.dropna(thresh=3)

          0         1         2
4 -0.344377 -1.351671  0.560334
5  1.790210 -0.372641 -1.273319
6 -1.037575  0.163970 -0.627537

In [59]:
df.fillna(0)

          0         1         2
0 -0.886260  0.000000  0.000000
1 -0.387692  0.000000  0.000000
2 -1.221398  0.000000 -1.664044
3  0.331100  0.000000 -0.770880
4 -0.344377 -1.351671  0.560334
5  1.790210 -0.372641 -1.273319
6 -1.037575  0.163970 -0.627537

In [70]:
df.fillna({1: 0.5, 3: -1})

          0    1         2
0 -2.094190  0.5 -0.543682
1 -1.106679  0.5 -0.263104
2 -1.507442  0.5  1.378023
3  0.323125  0.5  0.077384
4  1.301240  0.5       NaN
5  0.935592  0.5       NaN

In [71]:
_ = df.fillna(0, inplace=True)
df

          0    1         2
0 -2.094190  0.0 -0.543682
1 -1.106679  0.0 -0.263104
2 -1.507442  0.0  1.378023
3  0.323125  0.0  0.077384
4  1.301240  0.0  0.000000
5  0.935592  0.0  0.000000

In [72]:
df = DataFrame(np.random.randn(6,3))

In [73]:
df.iloc[2:,1] = NA ; df.iloc[4:, 2] = NA

In [74]:
df

          0         1         2
0  0.524923  2.022087  1.740059
1 -1.071012 -0.969123  0.904665
2  1.193887       NaN -0.140929
3 -1.383584       NaN -0.884518
4  0.978788       NaN       NaN
5 -0.819142       NaN       NaN

In [79]:
df.fillna(method='ffill', limit = 2)

          0         1         2
0  0.524923  2.022087  1.740059
1 -1.071012 -0.969123  0.904665
2  1.193887 -0.969123 -0.140929
3 -1.383584 -0.969123 -0.884518
4  0.978788       NaN -0.884518
5 -0.819142       NaN -0.884518

In [80]:
data = Series([1., NA, 3.5, NA, 7])

In [81]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64